LEXICON_RU: dict[str, str] = {
    "/start": (
        'Привет!\nДавай сыграем в игру "Угадай фильм по кадру"?\n\n'
        "Чтобы получить правила игры и список доступных "
        "команд - отправьте команду /help"
    ),
    "/help": (
        "Правила игры:\n\nЯ присылаю кадр из фильма, "
        "а вам нужно назвать его название.\n"
        "Необходимо указать точное название фильма вне зависимости от регистра\n"
        "Пример ответа: Форрест Гамп\n\n"
        "Доступные команды вне игры:\n\n"
        "/play - начать играть (доступна только вне игры)\n"
        "/stat - посмотреть статистику\n\n"
        "Доступные команды в игре\n\n"
        "/sur - сдаться (доступна только в игре)\n"
        "/cancel - отменить игру (доступна только в игре)\n\n"
        "Давай сыграем?"
    ),
    "/cancel": "Вы вышли из игры. Если захотите сыграть снова - напишите об этом. /play",
    "in_game_command": "Данная команда доступна только в игре. Мы сейчас с вами не играем. Хотите сыграть?",
    "not_in_game_command": "Данная команда доступна только вне игры. Мы сейчас играем. Хотите выйти?",
    "other": "Я играю только по правилам, введите /help, чтобы узнать правила.",
    "win": "Поздравляю, ты победил!",
    "lose": "К сожалению ты проиграл :(",
}


LEXICON_COMMANDS_RU: dict[str, str] = {
    "/help": "Правила игры и команды",
    "/play": "Начать играть (доступно вне игры)",
    "/surrender": "Сдаться (доступно в игре)",
    "/cancel": "Выход из режима игры (доступно в игре)",
    "/stat": "Посмотреть статистику (доступно вне игры)",
}
